Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: basic knowledge of navigation accidents, cause and effect relationships, risk analysis, the navigator/watch commander and crisis situations (behaviour and interaction between stress and problem solving in a crisis situation on the bridge)
nb: navigatør / vaktsjef og krisesituasjoner, (adferd og samspill mellom stress og problemløsninger i en krisesituasjon på bro) Med fokus på sjøforsvarets hendelser.

source: This means that the learning powers in lessons will focus on openness and feedback, before traditional teaching methods (lectures).
nb: Dette med fokus på individuell og kollektiv evne til å ta beslutninger (fagkompetanse) og evne til å skape oppslutning og samhandling (relasjonskompetanse), herudner skape gode beslutningsprosesser i lag og grupper.

source: International sea power and naval warfare history
nb: Internasjonal sjømakt og sjøkrigshistorie

source: The education includes both exercises and day training, primarily in team units.
nb: Utdanningen inneholder både øvelser og dagtreninger, primært i lagsforband.

source: demonstrate understanding and knowledge of requirements, methods and solutions for increased survival ability for machinery systems.
nb: bevise forståelse og kjennskap til krav, metoder og løsninger for økt overlevelsesevne for maskinerisystemer.

source: The course is based on ING1501 The Cyber Engineer's profession and ING3508 Military information infrastructure
nb: Emnet bygger på ING1501 Cyberingeniørens profesjon og ING3508 Militær informasjonsinfrastruktur

source: select and analyse instrumentation, analyse and adjust a regulator, programme an automation device (PLS) to perform security, automation and monitoring tasks.
nb: foreta valg og analyse av instrumentering, analysere og stille inn en regulator, programmere et automatiseringsapparat (PLS) til å utføre oppgaver innen sikkerhet, automatisering og overvåkning.

source: an understanding of the role of the military profession in Norwegian society, and how societal developments and the development of military power are interdependent.
nb: innsikt i den militære profesjonens plass i det norske samfunnet og den gjensidige påvirkningen i utviklingen av samfunnet og militærmakten.

source: analyse force systems, equilibrium and stability in two and three dimensions
nb: analysere kraftsystemer, likevekt og stabilitet i to og tre dimensjoner

source: Take into account the legislation and policy decisions in the planning and implementation of military air force missions in an international operation
nb: ta hensyn til lovverk og politiske beslutninger i planlegging og gjennomføring av luftmilitære oppdrag i en internasjonal operasjon

source: Organisation and work methods
nb: Organisering og arbeidsmåter

source: The UN was established just after World War II to avoid war in the future, and from 1948 has conducted peace operations in conflict areas to achieve this ambition.
nb: FN ble opprettet like etter andre verdenskrig for å unngå krig i fremtiden, og har fra 1948 gjennomført fredsoperasjoner i konfliktområder for å oppnå denne ambisjonen.

source: The gender perspective and impact on operations.
nb: Genderperspektivet og innvirkning på operasjoner.

source: Gas exchange process in two- and four-stroke engines.
nb: Gassvekslingen for to- og firetaktsmotorer.

source: Chapter 1.6 Respond to a distress signal at sea
nb: kapittel 1.6 Handling ved nødsignaler på sjøen

source: The content of the course is based on the document “Grunnmuren i Hærens sersjant- og offisersutdanning” (“The Foundations of the Army’s Sergeant and Officer Training”) (The Norwegian Military Academy, autumn 2017).
nb: Innholdet i emnet tar utgangspunkt i dokumentet "Grunnmuren i Hærens sersjant- og offisersutdanning" (Krigsskolen, høsten 2017).

source: assess the advantages and challenges of joint operations.
nb: vurdere fordeler og utfordringer med fellesoperasjoner.

source: explain the defence, environmental, health and economic consequences of products and solutions in nautical topics in the Navy and can put these in an ethical, tactical and life-long perspective.
nb: forklare forsvarsmessige, miljømessige, helsemessige og økonomiske konsekvenser av produkter og løsninger innen nautiske emner i Sjøforsvaret og kan sette disse i et etisk, taktisk og livsløpsperspektiv.

source: Induction motors, frequency converters and electric motor operation on Navy vessels.
nb: Asynkronmaskiner, frekvensomformere og elektrikse motordrifter på Sjøforsvarets fartøyer.

source: master a professional practice, also in teams and in an interdisciplinary context, and can adapt this to the current work situation.
nb: beherske faglig utøvelse, også i team og i en tverrfaglig sammenheng, og kan tilpasse denne til den aktuelle arbeidssituasjon.

source: understand key topics, theories, issues, tools and methods involving navigation with radar control method.
nb: sentrale temaer, teorier, problemstillinger, verktøy og metoder innenfor seilas med radar kontroll metode.

source: Week 4: National perspectives on UN peace operations
nb: Uke 4: Nasjonale perspektiver på FNs fredsbevarende operasjoner

source: Subtopic 3 – The operational environment and its impact on the possibilities and limitations of military forces: In the third subtopic of the course (two weeks), the focus is on the current and future operational environment, and what conditions and factors (
nb: Del 3 – Operasjonsmiljøet og dets innvirkning på militære styrkers muligheter og begrensninger: Emnets tredje del (en uker) setter fokus på dagens og morgensdagens operasjonsmiljø, og hvilke forhold og faktorer (

source: Military problem solving in the framework of peace staff service (Staff Study) and war staff service (Planning and Decision-Making Process), enables the cadet to make decisions as a leader and staff officer.
nb: Militær problemløsning i rammen av fredsstabstjeneste (stabsstudien) og krigsstabstjeneste (plan- og beslutningsprosess), setter kadetten i stand til å treffe beslutninger som leder og stabsoffiser.

source: Minus chapters 7, 8 and 9.
nb: Hele boken minus kapitlene 7, 8 og 9.

source: The course plan is based on IMO module courses 7.03 and 7.01
nb: Emneplanen tar utgangspunkt i IMO modulkurs 7.03 og 7.01

source: Off-design operation of gas turbines and turbochargers.
nb: Off-design drift av gassturbiner og turboladere.

source: apply theoretical knowledge, in combination with leadership experiences, to developmental and analytical tasks.
nb: anvende teoretisk kunnskap i kombinasjon med ledelseserfaringer i utviklings- og analysearbeid.

source: Bachelor’s degree in military studies with specialisation in management - Naval Engineer Machine, electronics and data (180 credits) comprises all courses under engineering basis, programme basis and technical specialisation and the common courses Marine Law and Law of the Sea,Basic Officer Competence, the Officer as a Leader and Military Problem-Solving and Methods.
nb: Bachelor i militære studier med fordypning i ledelse - marineingeniør elektro(180 sp.) består av alle emner under ingeniørfaglig basis, programfaglig basis og teknisk spesialisering samt fellesemnene Grunnleggende offiserskompetanse, Offiseren som leder og Militær problemløsning og metode.

source: How to protect civilians from violence through the use of military force?
nb: Hvordan beskytte sivile fra vold ved bruk av militærmakt

source: understand and make use of relevant professional terminology
nb: forstå og bruke relevant engelsk fagterminologi

source: understanding the basic principles that apply to the effect of dead weight, draft, trim, speed and under keel clearance of swing radius and stopping distances.
nb: forståelse for grunnprinsippene som gjelder for virkning av dødvekt, dypgang, trim, fart og klaring under kjølen på svingeradius og stoppedistanser.

source: In addition, there is an increased focus on group dynamics and efficiency (the troop).
nb: I tillegg legges det økt fokus på gruppedynamikk og – effektivitet (laget).

source: Mass forces and balancing of oscillating and rotating engines, calculation of median tangential forces from pressure/angle readings.
nb: Massekrefter og utbalansering av oscillerende og roterende maskineri, beregning av midlere tangentialkraft fra trykk/vinkelmålinger.

source: Systems theory with Fourier series, Fourier transforms and Laplace transforms.
nb: Systemteori med diskrete fourier-rekker, Fourier-transformasjon og Laplace-transformasjon.

source: Discuss your own practice in relation to relevant theory, knowledge and research.
nb: drøfte egen praksis i lys av relevant teori, kunnskap og forskning.

source: Approximately 16 hours of work per week is expected (lectures, problem solving, project work, independent study).
nb: Det forventes ca 16 timer arbeidsinnsats per uke (forelesning, oppgaveløsning, prosjekt, selvstudium).

source: • apply the wave equation
nb: • anvende bølgeligningen

source: Discuss your own practice in the light of relevant theory, knowledge and research.
nb: drøfte hva innovasjon er, og hvordan gode ledere kan bidra til militær innovasjon.

source: The Royal Norwegian Naval Academy will enable the cadets to apply knowledge from the discipline during night-time sails/weekend sails/exercises with training vessels or naval ships, in addition to other exercises within navigation training, including the navigation exercise MPN 6 especially.
nb: Sjøkrigsskolen vil legge til rette for at kadettene kan anvende kunnskap fra faget under kveldsseilaser/ helgeseilaser/ øvelser med skolefartøy eller marinefartøy samt andre øvelser i navigasjonsutdanningen herunder spesielt navigasjonsøvelse MPN 6.

source: knowledge of the military use of satellite-based navigation, the use of satellite-based systems and navigation warfare (NAVWAR)
nb: kunnskap om militær bruk av satellittbasert navigasjon, sårbahet ifm bruk av satellittbaserte systemer og navigasjonskrigføring (NAVWAR)

source: The main emphasis is placed on the Norwegian Armed Forces Land Operations Doctrine (FDLO), where the Army and land power is key.
nb: Hovedvekt blir lagt på Forsvarets doktrine for landoperasjoner (FDLO), der Hæren og landmakten er det sentrale.

source: show the will and ability to cope with stress and discomfort.
nb: vise vilje og evne til å mestre belastninger og ubehag.

source: Alloy elements in iron and steel.
nb: Legeringselementene i jern og stål.

source: Lectures, compulsory laboratory assignments and assignment solving.
nb: Forelesninger, obligatorisk laboratorieoppgave og oppgaveløsning.

source: • demonstrate understanding of the mathematical concepts, problems and solution methods that are a part of the course’s topics in linear algebra
nb: • vise forståelse av de matematiske begreper, problemstillinger og løsningsmetoder som inngår i emnets temaer innen lineær algebra

source: understand the importance of good cooperation with others in the team (CRM)
nb: forstå viktigheten av godt samarbeid med andre i teamet(CRM)

source: Adaptive (Kalman) filter, construction and manner of operation.
nb: Adaptive (Kalman) filtre, konstruksjon og virkemåte.

source: Simulator exercises 1 to 7 in semester 4.
nb: Simulatorøvingene 1 til 7 semester 4.

source: Regulations relating to the Special Appeals Committee for Universities and University Colleges in Norway, the Public Administration Act, the Act relating to Universities and University Colleges, and the Norwegian Defence University College’s own exam regulations.
nb: Forskrift om felles klagenemd for behandling av klagesaker, Forvaltningsloven, Lov om universiteter og høyskoler, samt Forsvarets høgskoles egen eksamensforskrift.

source: (model testing, heeling tests, shallow water effects.)
nb: (modellprøver, krengeforsøk, gruntvannseffekt.)

source: The course also builds on the insights the students have from MILM 1102 about the officer’s role and responsibilities in the Norwegian society, and the insights in the nature and character of war the students have from MILM 1103.
nb: Emnet bygger også videre på innsikten kadettene fikk i emne MILM 1102 om offiserens rolle og ansvar i samfunnet, og innsikten i krigens natur og karakter som kadettene fikk i emne MILM 1103.

source: There will be a 4-hour bulk of simulator training on the schedule.
nb: På timeplanen skal det være 4 timer simulator i en bolk.

source: Other relevant degree or vocational education lasting a minimum of 3 years
nb: Annen relevant grad eller yrkesutdanning av minimum 3 års omfang

source: Topic 4 – The Future Officer
nb: Tema 4 - Den fremtidige offiseren

source: describe control and regulation of marine turbomachinery.
nb: beskrive kontroll og regulering av marine turbomaskiner.

source: Insight into the theory will provide cadets with a grounding in how to plan, lead and deploy with a detachment to an international operation.
nb: En innsikt i teorien vil gi kadettene grunnlag til å forstå hvordan man skal planlegge, lede og deployere med et detasjement til en internasjonal operasjon.

source: The effect that a load, including heavy lifting, has on a ship's stability and seaworthiness.
nb: Påvirkning lasten, inkludert tungløft, har på et skips stabilitet og sjødyktighet.

source: Chapter 1.5 Respond to emergencies
nb: Kapittel 1.5 Handling ved nød

source: The process will start in semester 5, with choice of problem area, and breakdown to problem and research design/choice of method.
nb: Prosessen vil begynne i semester 5, med valg av problemområde, og nedbrytning til problemstilling og forskningsdesign/ metodevalg.

source: knowledge of research and development work in underwater acoustics, navigation equipment, navigation systems and integrated navigation systems.
nb: kunnskap om forsknings- og utviklingsarbeid innenfor undervannsakustikk, navigasjonsutstyr, navigasjonssystemer samt integrerte navigasjonssystmer.

source: Naval rules and requirements for intact and damaged stability.
nb: Militære krav til intakt og skadestabilitet.

source: The Armed Forces' leadership philosophy, Mission-Based Leadership(OBL), intends to contribute to a decentralized decision-making and control authority.
nb: Forsvarets ledelsesfilosofi, Oppdragsbasert Ledelse (OBL) har til hensikt å bidra til en desentralisert beslutnings- og handlingsmyndighet.

source: The subject focuses on the exercise of military air force command in an international context.
nb: Temaet fokuserer på utøvelse av luftmilitært lederskap i en internasjonal kontekst.

source: The course provides cadets with a general introduction to the theory of organisation and management of a military organisation such as the RNAF, in addition to understanding the organisation's role in the management of crises.
nb: Emnet skal gi kadettene en generell innføring i teori omkring organisasjon og ledelse av en militær organisasjon som Luftforsvaret og forståelse for organisasjonens rolle ved håndtering av krise.

source: Control and notification:
nb: Kontroll og varsling:

source: This course module will include technology and innovation in a military context.
nb: Delemnet vil omfatte teknologi og innovasjon i en militær kontekst.

source: Self-selected literature (50 pages):
nb: Selvvalgt litteratur (50 sider):

source: Dietlefsen: chapter B. The Norwegian Pilot: volume 1, chapter VIII
nb: Den norske los: bind 1 kapittel VIII

source: knowledge of the history and development of technology with emphasis on information and communication technology, the cyber engineer’s role in the Norwegian Armed Forces and in society, and consequences of the development and application of technology.
nb: kunnskap om teknologiens historie og utvikling med vekt på informasjons- og kommunikasjonsteknologi, cyberingeniørens rolle i Forsvaret og i samfunnet, og konsekvenser av utvikling og anvendelse av teknologi.

source: - Communicate knowledge about UN peace operations in and outside the defense sector.
nb: - Formidle kunnskap om FNs fredsoperasjoner i og utenfor forsvarssektoren.

source: dimension hydraulic pump/engine for given system.
nb: dimensjonere hydraulisk pumpe/motor for gitt system.

source: • Ultrasonic- and distance measurements
nb: • Parallelle og serielle inn- og utkretser

source: is a lengthy training period with one’s own combat arms, and is intended to be a reference for further education and development at the Norwegian Defence University College.
nb: er en lengre praksisperioden i eget våpen, og er ment å være en referanse for videre utdanning og utvikling på Forsvarets Høyskole.

source: We also discuss the role and significance of the UN Charter and the background of the bedrock principles of peacekeeping.
nb: Vi diskuterer også FN charterets rolle og betydning og bakgrunnen for de grunnleggende prinsippene for fredsbevaring.

source: focuses on a basic knowledge and understanding of the application of military force (military powers and tools) within a joint operational framework.
nb: på grunnleggende kunnskap og forståelse for anvendelse av militærmakt (militære styrker og virkemidler) i en fellesoperativ ramme.

source: explain what security monitoring, vulnerability mapping, penetration testing, digital forensics and analysis of malicious software are all about, and their application in a technical, tactical, legal and ethical perspective
nb: forklare hva sikkerhetsmessig overvåkning, sårbarhetskartlegging, penetrasjonstesting, digital etterforskning og analyse av ondsinnet programvare går ut på, og anvendelsen av dette i et teknisk, taktisk, juridisk og etisk perspektiv

source: communicate in English orally (listening and speaking) and in writing (reading and writing) within selected topics from the course
nb: kommunisere på engelsk muntlig (lytte og tale) og skriftlig (lese og skrive) innenfor utvalgte temaer fra emnet

source: demonstrate practical and theoretical insight into material testing and laboratory work.
nb: vise praktisk og teoretisk innsikt i materialprøving og laboratoriearbeider.

source: Meteorology and Oceanography
nb: Kompendium delt ut av faglærer.

source: Safe handling of cargo according to applicable regulations – IMDG, IMSBC and MARPOL 73/78, Annex III and V
nb: Sikker behandling av last i henhold til gjeldende regelver – IMDG, IMSBC og MARPOL 73/78, Annex III og V

source: describe the history of the field (geomatics) and social impact
nb: beskrive fagfeltets (geomatikk) historie og samfunnspåvirkning

source: discuss different texts and recognize and transfer relevant knowledge between different contexts.
nb: drøfte ulike engelske tekster og gjenkjenne og overføre relevant læring mellom ulike kontekster.

source: Historical theory and methodology
nb: Historisk teori og metode

source: The fourth part of the course (2 weeks) focuses on analyses of various historical events (case studies), where the purpose is to identify what the powers of the various branches of the Norwegian Armed Forces contributed to, and the conditions which greatly influenced the implementation of these.
nb: Emnets fjerde del (2 uker) fokuserer på analyser av ulike historiske hendelser (tilfellestudier), der hensikten er å identifisere hva de ulike forsvarsgrensvise styrker bidro med, og hvilke forhold som i stort påvirket gjennomføringen av disse.

source: • demonstrate elementary understanding of Maxwell’s equations
nb: • vise elementær forståelse for Maxwell’s ligninger

source: Lectures, military basic training period, autumn exercise “Initial Entry”, seminars, group work, presentation and process writing.
nb: Forelesninger, militær grunnlagsperiode, høstøvelse «Initial Entry», seminarer, gruppearbeid, presentasjon og prosesskriving.

source: On Kvarven and Nordnes, the navigator’s view is physically blocked by curtains.
nb: På Kvarven og Nordnes er utsikten til navigatøren fysisk blokkert av gardiner.

source: Evaluation and quality assurance
nb: Evaluering og kvalitetssikring

source: Be aware of new thinking and innovation processes.
nb: Kjenne til nytenkning og innovasjonsprosesser.

source: Lectures, tests, student presentations and exercises
nb: Forelesninger, prøver, studentpresentasjoner og øvinger

source: In the period leading up to 2014, the alliance developed towards becoming a collective security organisation, both within and outside of the Euro-Atlantic area.
nb: I tiden frem mot 2014 utviklet alliansen seg mot å bli en organisasjon for kollektiv sikkerhet, både i og utenfor det euro-atlantiske området.

source: Emphasis is placed on using examples from other subjects and from the service to illustrate topics in the course, cf. general plan for SKSK 1, item 5.1.3.
nb: Det skal legges vekt på å bruke eksempler fra andre fag og fra tjenesten som illustrasjon av emnet, jf. rammeplan for SKSK 1 punkt 5.1.3.

source: reason systematically and solve problems related to a naval vessels' stability, conditions in relation to structural strength, movements and the energy demand for propulsion
nb: resonnere systematisk og løse problemer knyttet til marinefartøyers stabilitet, styrkemessige forhold, bevegelser og energibehovet til framdrift

source: In this section, key aspects and theories about what defines, characterises and shapes the culture and nuances of the various branches of the Norwegian Armed Forces (land, sea and air) are explored.
nb: I denne delen vil sentrale aspekter og teorier omkring hva som definerer, preger og former de ulike forsvarsgrenenes (land, sjø og luft) kultur og særegenheter bli behandlet.

source: • apply basic methods and tools for engineering analysis, development and operation of information and communication technology.
nb: • anvende grunnleggende metoder og verktøy for ingeniørfaglig analyse, utvikling og drift av informasjons- og kommunikasjonsteknologi.

source: Dilemmas of protecting civilians in UN operations
nb: Dilemmaer ved beskyttelse av sivile i FN-operasjoner

source: Students begin their education at Naval Air Station Pensacola and continue at Naval Air Station Whiting Field and Naval Air Station Corpus Christi.
nb: Elevene starter utdanningen ved Naval Air Station Pensacola og forsetter ved Naval Air Station Whiting Field og Naval Air Station Corpus Christi.

source: Lectures, exercises, compulsory assignments and compulsory status tests, project work with statistical data tools.
nb: Forelesninger, øvinger, obligatoriske innleveringer og obligatoriske statustester, prosjektarbeid med statistisk dataverktøy.

source: The mutual influence between society and the military power from 1750 to today.
nb: Den gjensidige påvirkning mellom samfunnet og militærmakten fra 1750 til i dag.

source: Account for the gathering of relevant information from various data sources, and compile and analyse data in accordance with a scientific method.
nb: Gjøre rede for innhenting av relevant informasjon fra forskjellige datakilder, og sammenstille og analysere data etter en vitenskapelig metode.

source: Mandates, mandate development and the basic principles of peacekeeping.
nb: Mandater, mandatutvikling og de grunnleggende prinsipper for fredsbevaring.

source: This basis is a premise for the staff study and the planning and decision-making process, as well as a methodological starting point for any master's studies.
nb: Dette grunnlaget er et premiss for stabsstudien og plan- og beslutningsprosessen, samt et metodisk utgangspunkt for eventuelle masterstudier.

source: The practice arena begins with one week of Battle Staff Training, where students get a theoretical introduction to processes and procedures used in an operational headquarters.
nb: Praksisarenaen innledes med én ukes Battle Staff Training, hvor studentene får en teoretisk innføring i prosesser og prosedyrer som nyttes i et operasjonelt hovedkvarter.

source: Module 3: The operational environment
nb: Delemne 3: Operasjonsmiljøet
